<!-- infrastructure/networking: do not delete/edit this line -->
#### Terraform Format and Style 🖌\`failure\`
#### Terraform Initialization ⚙️\`success\`
#### Terraform Validation 🤖\`success\`
<details><summary>Validation Output</summary>

\`\`\`\n
[32m[1mSuccess![0m The configuration is valid.
[0m

\`\`\`

</details>

#### Terraform Plan 📖\`success\`

<details><summary>Show Plan</summary>

\`\`\`
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/jolfr-personal/networking/runs/run-h5LPEPtB3wRXVJoH

Waiting for the plan to start...

Terraform v1.11.2
on linux_amd64
Initializing plugins and modules...
data.google_project.current: Refreshing...
data.google_client_openid_userinfo.me: Refreshing...
data.google_client_config.current: Refreshing...
data.google_client_config.current: Refresh complete after 0s [id=projects/data-project-example-454322/regions/us-central1/zones/]
data.google_client_openid_userinfo.me: Refresh complete after 0s [id=terraform@data-project-example-454322.iam.gserviceaccount.com]
data.google_project.current: Refresh complete after 0s [id=projects/data-project-example-454322]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_backend_service.backend_service["cd"] will be created
  + resource "google_compute_backend_service" "backend_service" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + fingerprint                     = (known after apply)
      + generated_id                    = (known after apply)
      + health_checks                   = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "data-project-example-454322-cd-backend"
      + port_name                       = "http"
      + project                         = "data-project-example-454322"
      + protocol                        = "HTTP"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = 30

      + cdn_policy (known after apply)

      + iap {
          + enabled                     = true
          + oauth2_client_id            = (sensitive value)
          + oauth2_client_secret        = (sensitive value)
          + oauth2_client_secret_sha256 = (sensitive value)
        }

      + log_config (known after apply)
    }

  # google_compute_backend_service.backend_service["root"] will be created
  + resource "google_compute_backend_service" "backend_service" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + fingerprint                     = (known after apply)
      + generated_id                    = (known after apply)
      + health_checks                   = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "data-project-example-454322-root-backend"
      + port_name                       = "http"
      + project                         = "data-project-example-454322"
      + protocol                        = "HTTP"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = 30

      + cdn_policy (known after apply)

      + iap {
          + enabled                     = true
          + oauth2_client_id            = (sensitive value)
          + oauth2_client_secret        = (sensitive value)
          + oauth2_client_secret_sha256 = (sensitive value)
        }

      + log_config (known after apply)
    }

  # google_compute_firewall.allow_api_server[0] will be created
  + resource "google_compute_firewall" "allow_api_server" {
      + creation_timestamp = (known after apply)
      + description        = "Allow access to the Kubernetes API server"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "k8s-vpc-allow-api-server"
      + network            = "k8s-vpc"
      + priority           = 1000
      + project            = "data-project-example-454322"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + allow {
          + ports    = [
              + "443",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.allow_health_checks[0] will be created
  + resource "google_compute_firewall" "allow_health_checks" {
      + creation_timestamp = (known after apply)
      + description        = "Allow health checks from Google Cloud load balancers"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "k8s-vpc-allow-health-checks"
      + network            = "k8s-vpc"
      + priority           = 1000
      + project            = "data-project-example-454322"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "130.211.0.0/22",
          + "35.191.0.0/16",
        ]

      + allow {
          + ports    = []
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.allow_iap[0] will be created
  + resource "google_compute_firewall" "allow_iap" {
      + creation_timestamp = (known after apply)
      + description        = "Allow traffic from Identity-Aware Proxy"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "k8s-vpc-allow-iap"
      + network            = "k8s-vpc"
      + priority           = 1000
      + project            = "data-project-example-454322"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "35.235.240.0/20",
        ]

      + allow {
          + ports    = [
              + "22",
              + "80",
              + "443",
              + "8080",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.allow_internal[0] will be created
  + resource "google_compute_firewall" "allow_internal" {
      + creation_timestamp = (known after apply)
      + description        = "Allow internal traffic between instances in the VPC"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "k8s-vpc-allow-internal"
      + network            = "k8s-vpc"
      + priority           = 1000
      + project            = "data-project-example-454322"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "10.0.0.0/20",
        ]

      + allow {
          + ports    = []
          + protocol = "icmp"
        }
      + allow {
          + ports    = []
          + protocol = "tcp"
        }
      + allow {
          + ports    = []
          + protocol = "udp"
        }
    }

  # google_compute_global_address.static_ip["cd"] will be created
  + resource "google_compute_global_address" "static_ip" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + description        = "Global static IP for cd.data-project-example.net"
      + effective_labels   = {
          + "domain"                     = "data-project-example-net"
          + "goog-terraform-provisioned" = "true"
          + "subdomain"                  = "cd"
        }
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + labels             = {
          + "domain"    = "data-project-example-net"
          + "subdomain" = "cd"
        }
      + name               = "data-project-example-454322-cd"
      + prefix_length      = (known after apply)
      + project            = "data-project-example-454322"
      + self_link          = (known after apply)
      + terraform_labels   = {
          + "domain"                     = "data-project-example-net"
          + "goog-terraform-provisioned" = "true"
          + "subdomain"                  = "cd"
        }
    }

  # google_compute_global_address.static_ip["root"] will be created
  + resource "google_compute_global_address" "static_ip" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + description        = "Global static IP for root.data-project-example.net"
      + effective_labels   = {
          + "domain"                     = "data-project-example-net"
          + "goog-terraform-provisioned" = "true"
          + "subdomain"                  = "root"
        }
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + labels             = {
          + "domain"    = "data-project-example-net"
          + "subdomain" = "root"
        }
      + name               = "data-project-example-454322-root"
      + prefix_length      = (known after apply)
      + project            = "data-project-example-454322"
      + self_link          = (known after apply)
      + terraform_labels   = {
          + "domain"                     = "data-project-example-net"
          + "goog-terraform-provisioned" = "true"
          + "subdomain"                  = "root"
        }
    }

  # google_compute_global_forwarding_rule.forwarding_rule["cd"] will be created
  + resource "google_compute_global_forwarding_rule" "forwarding_rule" {
      + base_forwarding_rule  = (known after apply)
      + effective_labels      = (known after apply)
      + forwarding_rule_id    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = (known after apply)
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "data-project-example-454322-cd-forwarding-rule"
      + network               = (known after apply)
      + network_tier          = (known after apply)
      + port_range            = "443"
      + project               = "data-project-example-454322"
      + psc_connection_id     = (known after apply)
      + psc_connection_status = (known after apply)
      + self_link             = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
      + terraform_labels      = (known after apply)

      + service_directory_registrations (known after apply)
    }

  # google_compute_global_forwarding_rule.forwarding_rule["root"] will be created
  + resource "google_compute_global_forwarding_rule" "forwarding_rule" {
      + base_forwarding_rule  = (known after apply)
      + effective_labels      = (known after apply)
      + forwarding_rule_id    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = (known after apply)
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "data-project-example-454322-root-forwarding-rule"
      + network               = (known after apply)
      + network_tier          = (known after apply)
      + port_range            = "443"
      + project               = "data-project-example-454322"
      + psc_connection_id     = (known after apply)
      + psc_connection_status = (known after apply)
      + self_link             = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
      + terraform_labels      = (known after apply)

      + service_directory_registrations (known after apply)
    }

  # google_compute_health_check.health_check["cd"] will be created
  + resource "google_compute_health_check" "health_check" {
      + check_interval_sec  = 5
      + creation_timestamp  = (known after apply)
      + healthy_threshold   = 2
      + id                  = (known after apply)
      + name                = "data-project-example-454322-cd-health-check"
      + project             = "data-project-example-454322"
      + self_link           = (known after apply)
      + timeout_sec         = 5
      + type                = (known after apply)
      + unhealthy_threshold = 2

      + http_health_check {
          + port         = 80
          + proxy_header = "NONE"
          + request_path = "/healthz"
        }

      + log_config (known after apply)
    }

  # google_compute_health_check.health_check["root"] will be created
  + resource "google_compute_health_check" "health_check" {
      + check_interval_sec  = 5
      + creation_timestamp  = (known after apply)
      + healthy_threshold   = 2
      + id                  = (known after apply)
      + name                = "data-project-example-454322-root-health-check"
      + project             = "data-project-example-454322"
      + self_link           = (known after apply)
      + timeout_sec         = 5
      + type                = (known after apply)
      + unhealthy_threshold = 2

      + http_health_check {
          + port         = 80
          + proxy_header = "NONE"
          + request_path = "/healthz"
        }

      + log_config (known after apply)
    }

  # google_compute_managed_ssl_certificate.ssl_cert["cd"] will be created
  + resource "google_compute_managed_ssl_certificate" "ssl_cert" {
      + certificate_id            = (known after apply)
      + creation_timestamp        = (known after apply)
      + expire_time               = (known after apply)
      + id                        = (known after apply)
      + name                      = "data-project-example-454322-cd-cert"
      + project                   = "data-project-example-454322"
      + self_link                 = (known after apply)
      + subject_alternative_names = (known after apply)
      + type                      = "MANAGED"

      + managed {
          + domains = [
              + "cd.data-project-example.net",
            ]
        }
    }

  # google_compute_managed_ssl_certificate.ssl_cert["root"] will be created
  + resource "google_compute_managed_ssl_certificate" "ssl_cert" {
      + certificate_id            = (known after apply)
      + creation_timestamp        = (known after apply)
      + expire_time               = (known after apply)
      + id                        = (known after apply)
      + name                      = "data-project-example-454322-root-cert"
      + project                   = "data-project-example-454322"
      + self_link                 = (known after apply)
      + subject_alternative_names = (known after apply)
      + type                      = "MANAGED"

      + managed {
          + domains = [
              + "data-project-example.net",
            ]
        }
    }

  # google_compute_network.vpc will be created
  + resource "google_compute_network" "vpc" {
      + auto_create_subnetworks                   = false
      + bgp_always_compare_med                    = (known after apply)
      + bgp_best_path_selection_mode              = (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + delete_default_routes_on_create           = false
      + description                               = "VPC network for Kubernetes cluster"
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "k8s-vpc"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + network_id                                = (known after apply)
      + numeric_id                                = (known after apply)
      + project                                   = "data-project-example-454322"
      + routing_mode                              = "REGIONAL"
      + self_link                                 = (known after apply)
    }

  # google_compute_subnetwork.subnets[0] will be created
  + resource "google_compute_subnetwork" "subnets" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.0.0.0/20"
      + ipv6_cidr_range            = (known after apply)
      + ipv6_gce_endpoint          = (known after apply)
      + name                       = "k8s-subnet"
      + network                    = (known after apply)
      + private_ip_google_access   = true
      + private_ipv6_google_access = (known after apply)
      + project                    = "data-project-example-454322"
      + purpose                    = (known after apply)
      + region                     = "us-central1"
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
      + subnetwork_id              = (known after apply)

      + secondary_ip_range {
          + ip_cidr_range = "10.16.0.0/12"
          + range_name    = "pods"
        }
      + secondary_ip_range {
          + ip_cidr_range = "10.32.0.0/16"
          + range_name    = "services"
        }
    }

  # google_compute_target_https_proxy.https_proxy["cd"] will be created
  + resource "google_compute_target_https_proxy" "https_proxy" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "data-project-example-454322-cd-https-proxy"
      + project            = "data-project-example-454322"
      + proxy_bind         = (known after apply)
      + proxy_id           = (known after apply)
      + quic_override      = "NONE"
      + self_link          = (known after apply)
      + ssl_certificates   = (known after apply)
      + tls_early_data     = (known after apply)
      + url_map            = (known after apply)
    }

  # google_compute_target_https_proxy.https_proxy["root"] will be created
  + resource "google_compute_target_https_proxy" "https_proxy" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "data-project-example-454322-root-https-proxy"
      + project            = "data-project-example-454322"
      + proxy_bind         = (known after apply)
      + proxy_id           = (known after apply)
      + quic_override      = "NONE"
      + self_link          = (known after apply)
      + ssl_certificates   = (known after apply)
      + tls_early_data     = (known after apply)
      + url_map            = (known after apply)
    }

  # google_compute_url_map.url_map["cd"] will be created
  + resource "google_compute_url_map" "url_map" {
      + creation_timestamp = (known after apply)
      + default_service    = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "data-project-example-454322-cd-url-map"
      + project            = "data-project-example-454322"
      + self_link          = (known after apply)
    }

  # google_compute_url_map.url_map["root"] will be created
  + resource "google_compute_url_map" "url_map" {
      + creation_timestamp = (known after apply)
      + default_service    = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "data-project-example-454322-root-url-map"
      + project            = "data-project-example-454322"
      + self_link          = (known after apply)
    }

  # google_iam_workload_identity_pool.github_pool will be created
  + resource "google_iam_workload_identity_pool" "github_pool" {
      + description               = "Identity pool for GitHub Actions workflows"
      + display_name              = "GitHub Actions Identity Pool"
      + id                        = (known after apply)
      + name                      = (known after apply)
      + project                   = "data-project-example-454322"
      + state                     = (known after apply)
      + workload_identity_pool_id = "dataproj-github-pool"
    }

  # google_iam_workload_identity_pool_provider.github_provider will be created
  + resource "google_iam_workload_identity_pool_provider" "github_provider" {
      + attribute_condition                = "attribute.repository==\"jolfr/data-project-example\""
      + attribute_mapping                  = {
          + "attribute.actor"      = "assertion.actor"
          + "attribute.ref"        = "assertion.ref"
          + "attribute.repository" = "assertion.repository"
          + "google.subject"       = "assertion.sub"
        }
      + description                        = "Allow GitHub Actions workflows to impersonate service accounts"
      + display_name                       = "GitHub Actions Provider"
      + id                                 = (known after apply)
      + name                               = (known after apply)
      + project                            = "data-project-example-454322"
      + state                              = (known after apply)
      + workload_identity_pool_id          = "dataproj-github-pool"
      + workload_identity_pool_provider_id = "github-provider"

      + oidc {
          + issuer_uri = "https://token.actions.githubusercontent.com"
        }
    }

  # google_iap_web_backend_service_iam_binding.read_access["root"] will be created
  + resource "google_iap_web_backend_service_iam_binding" "read_access" {
      + etag                = (known after apply)
      + id                  = (known after apply)
      + members             = [
          + "serviceAccount:terraform@data-project-example-454322.iam.gserviceaccount.com",
        ]
      + project             = "data-project-example-454322"
      + role                = "roles/iap.httpsResourceAccessor"
      + web_backend_service = "data-project-example-454322-root-backend"
    }

  # google_iap_web_backend_service_iam_binding.write_access["cd"] will be created
  + resource "google_iap_web_backend_service_iam_binding" "write_access" {
      + etag                = (known after apply)
      + id                  = (known after apply)
      + members             = [
          + "serviceAccount:terraform@data-project-example-454322.iam.gserviceaccount.com",
        ]
      + project             = "data-project-example-454322"
      + role                = "roles/iap.httpsResourceAccessor"
      + web_backend_service = "data-project-example-454322-cd-backend"
    }

  # google_iap_web_backend_service_iam_member.member["cd"] will be created
  + resource "google_iap_web_backend_service_iam_member" "member" {
      + etag                = (known after apply)
      + id                  = (known after apply)
      + member              = "serviceAccount:terraform@data-project-example-454322.iam.gserviceaccount.com"
      + project             = "data-project-example-454322"
      + role                = "roles/iap.httpsResourceAccessor"
      + web_backend_service = "data-project-example-454322-cd-backend"
    }

  # google_iap_web_backend_service_iam_member.member["root"] will be created
  + resource "google_iap_web_backend_service_iam_member" "member" {
      + etag                = (known after apply)
      + id                  = (known after apply)
      + member              = "serviceAccount:terraform@data-project-example-454322.iam.gserviceaccount.com"
      + project             = "data-project-example-454322"
      + role                = "roles/iap.httpsResourceAccessor"
      + web_backend_service = "data-project-example-454322-root-backend"
    }

  # google_project_iam_binding.github_admin_access["roles/container.admin"] will be created
  + resource "google_project_iam_binding" "github_admin_access" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:terraform@data-project-example-454322.iam.gserviceaccount.com",
        ]
      + project = "data-project-example-454322"
      + role    = "roles/container.admin"
    }

  # google_project_iam_binding.github_admin_access["roles/iap.httpsResourceAccessor"] will be created
  + resource "google_project_iam_binding" "github_admin_access" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:terraform@data-project-example-454322.iam.gserviceaccount.com",
        ]
      + project = "data-project-example-454322"
      + role    = "roles/iap.httpsResourceAccessor"
    }

  # google_project_iam_binding.github_read_access["roles/iap.httpsResourceAccessor"] will be created
  + resource "google_project_iam_binding" "github_read_access" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:terraform@data-project-example-454322.iam.gserviceaccount.com",
        ]
      + project = "data-project-example-454322"
      + role    = "roles/iap.httpsResourceAccessor"
    }

  # google_project_iam_binding.github_write_access["roles/container.developer"] will be created
  + resource "google_project_iam_binding" "github_write_access" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:terraform@data-project-example-454322.iam.gserviceaccount.com",
        ]
      + project = "data-project-example-454322"
      + role    = "roles/container.developer"
    }

  # google_project_iam_binding.github_write_access["roles/iap.httpsResourceAccessor"] will be created
  + resource "google_project_iam_binding" "github_write_access" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:terraform@data-project-example-454322.iam.gserviceaccount.com",
        ]
      + project = "data-project-example-454322"
      + role    = "roles/iap.httpsResourceAccessor"
    }

  # google_project_iam_member.network_admin_roles["roles/compute.networkAdmin"] will be created
  + resource "google_project_iam_member" "network_admin_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:network-admin-sa@data-project-example-454322.iam.gserviceaccount.com"
      + project = "data-project-example-454322"
      + role    = "roles/compute.networkAdmin"
    }

  # google_project_iam_member.network_admin_roles["roles/compute.securityAdmin"] will be created
  + resource "google_project_iam_member" "network_admin_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:network-admin-sa@data-project-example-454322.iam.gserviceaccount.com"
      + project = "data-project-example-454322"
      + role    = "roles/compute.securityAdmin"
    }

  # google_project_iam_member.network_admin_roles["roles/dns.admin"] will be created
  + resource "google_project_iam_member" "network_admin_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:network-admin-sa@data-project-example-454322.iam.gserviceaccount.com"
      + project = "data-project-example-454322"
      + role    = "roles/dns.admin"
    }

  # google_service_account.network_admin will be created
  + resource "google_service_account" "network_admin" {
      + account_id   = "network-admin-sa"
      + description  = "Service account for managing VPC networks and firewall rules"
      + disabled     = false
      + display_name = "Network Administrator Service Account"
      + email        = "network-admin-sa@data-project-example-454322.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:network-admin-sa@data-project-example-454322.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "data-project-example-454322"
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_binding.github_workload_identity_binding will be created
  + resource "google_service_account_iam_binding" "github_workload_identity_binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = (known after apply)
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

Plan: 36 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + github_oauth_client_id                  = (sensitive value)
  + iap_web_backend_service_configs         = (sensitive value)
  + network_service_account_email           = (sensitive value)
  + network_service_account_name            = (sensitive value)
  + project                                 = "data-project-example-454322"
  + region                                  = "us-central1"
  + static_ip_details                       = (sensitive value)
  + subdomain_configs                       = [
      + {
          + address_type        = "EXTERNAL"
          + description         = ""
          + github_access_level = "READ"
          + iap_enabled         = true
          + name                = "root"
          + network_tier        = "PREMIUM"
        },
      + {
          + address_type        = "EXTERNAL"
          + description         = ""
          + github_access_level = "WRITE"
          + iap_enabled         = true
          + name                = "cd"
          + network_tier        = "PREMIUM"
        },
    ]
  + subnet_ids                              = (sensitive value)
  + subnet_secondary_ranges                 = (sensitive value)
  + subnet_self_links                       = (sensitive value)
  + subnets                                 = (sensitive value)
  + vpc                                     = (sensitive value)
  + workload_identity_pool_name             = (sensitive value)
  + workload_identity_provider              = (sensitive value)
  + workload_identity_provider_display_name = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

\`\`\`

</details>

*Pusher: @jolfr, Action: \`pull_request\`, Working Directory: \`infrastructure/networking\`, Workflow: \`Pull Request\`*